; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v1)
             (pred_8 ?v7 ?v2)
             (pred_4 ?v13 ?v2)
             (pred_5 ?v5 ?v13 )
	     (pred_10 ?v13)
             (pred_9 ?v9)
             (pred_11 ?v7)
             (pred_3 ?v2)
             (pred_1 ?v13)
             (pred_6 ?v7)
             (pred_7 ?v13)
             (pred_12 ))



(:action op_1
:parameters (?v6 ?v3 ?v10 ?v8)
:precondition (and (pred_9 ?v6) (pred_9 ?v3) (pred_11 ?v10) (pred_3 ?v8)
          (pred_2 ?v6 ?v3) (pred_8 ?v10 ?v8)
                   (pred_4 ?v3 ?v8) (pred_10 ?v6) 
                   (pred_1 ?v3) (pred_6 ?v10))
:effect (and  (pred_7 ?v3) (not (pred_1 ?v3))))


(:action op_5
:parameters (?v6 ?v4)
:precondition (and (pred_9 ?v6) (pred_9 ?v4)
               (pred_10 ?v6) (pred_2 ?v6 ?v4) (pred_7 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v6))))

(:action op_2
:parameters (?v6 ?v10)
:precondition (and (pred_9 ?v6) (pred_11 ?v10) 
                  (pred_10 ?v6) (pred_5 ?v10 ?v6) (pred_12 ))
:effect (and (pred_6 ?v10)
   (not (pred_5 ?v10 ?v6)) (not (pred_12 ))))


(:action op_3
:parameters (?v6 ?v12 ?v11)
:precondition (and (pred_9 ?v6) (pred_11 ?v12) (pred_11 ?v11)
                  (pred_10 ?v6) (pred_6 ?v11) (pred_5 ?v12 ?v6))
:effect (and (pred_6 ?v12) (pred_5 ?v11 ?v6)
        (not (pred_6 ?v11)) (not (pred_5 ?v12 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_9 ?v6) (pred_11 ?v10) 
                  (pred_10 ?v6) (pred_6 ?v10))
:effect (and (pred_12 ) (pred_5 ?v10 ?v6) (not (pred_6 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_08 obj_19 obj_31 obj_15 obj_03 obj_10 obj_18 obj_24 obj_09 obj_04 obj_01 obj_14 obj_05 obj_11 obj_23 obj_20 obj_12 obj_21 obj_07 obj_02 obj_17 obj_27 obj_06 obj_16
    obj_30 obj_28 obj_25
    obj_13 obj_22 obj_29
    )

    (:init
       (pred_12)

       (pred_9 obj_26)
       (pred_9 obj_08)
       (pred_9 obj_19)
       (pred_9 obj_31)
       (pred_9 obj_15)
       (pred_9 obj_03)
       (pred_9 obj_10)
       (pred_9 obj_18)
       (pred_9 obj_24)
       (pred_9 obj_09)
       (pred_9 obj_04)
       (pred_9 obj_01)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_23)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_27)
       (pred_9 obj_06)
       (pred_9 obj_16)
       (pred_3 obj_30)
       (pred_3 obj_28)
       (pred_3 obj_25)
       (pred_11 obj_13)
       (pred_11 obj_22)
       (pred_11 obj_29)

       (pred_2 obj_26 obj_03)
       (pred_2 obj_26 obj_08)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_08 obj_26)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_31)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_31 obj_24)
       (pred_2 obj_31 obj_15)
       (pred_2 obj_31 obj_19)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_15 obj_31)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_26)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_24)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_24 obj_05)
       (pred_2 obj_24 obj_09)
       (pred_2 obj_24 obj_31)
       (pred_2 obj_24 obj_18)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_09 obj_24)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_14 obj_12)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_24)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_09)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_23 obj_02)
       (pred_2 obj_23 obj_20)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_01)
       (pred_2 obj_20 obj_23)
       (pred_2 obj_12 obj_27)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_14)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_21 obj_06)
       (pred_2 obj_21 obj_07)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_02 obj_23)
       (pred_2 obj_17 obj_27)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_27 obj_06)
       (pred_2 obj_27 obj_12)
       (pred_2 obj_27 obj_17)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_06 obj_27)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_03)
       (pred_4  obj_20 obj_30)
       (pred_4  obj_17 obj_28)
       (pred_4  obj_03 obj_25)
       (pred_7 obj_26)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_31)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_24)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_23)
       (pred_7 obj_12)
       (pred_7 obj_21)
       (pred_7 obj_07)
       (pred_7 obj_02)
       (pred_7 obj_27)
       (pred_7 obj_06)
       (pred_7 obj_16)

       (pred_8  obj_13 obj_30)
       (pred_8  obj_22 obj_28)
       (pred_8  obj_29 obj_25)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_22 obj_12)
       (pred_5 obj_29 obj_04)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_5 obj_29 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_05)))
)
)

; plan
1. (op_5 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 0 of 1
2. (op_5 obj_07 obj_21)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_21)
   goals met: 0 of 1
3. (op_5 obj_21 obj_12)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_12)
   goals met: 0 of 1
4. (op_5 obj_12 obj_14)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_14)
   goals met: 0 of 1
5. (op_5 obj_14 obj_01)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_01)
   goals met: 0 of 1
6. (op_5 obj_01 obj_04)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_04)
   goals met: 0 of 1
7. (op_2 obj_04 obj_29)
   deleted: (pred_5 obj_29 obj_04) (pred_12)
   added: (pred_6 obj_29)
   goals met: 0 of 1
8. (op_5 obj_04 obj_01)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_01)
   goals met: 0 of 1
9. (op_5 obj_01 obj_14)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_14)
   goals met: 0 of 1
10. (op_5 obj_14 obj_12)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_12)
   goals met: 0 of 1
11. (op_5 obj_12 obj_21)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_21)
   goals met: 0 of 1
12. (op_5 obj_21 obj_06)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_06)
   goals met: 0 of 1
13. (op_4 obj_06 obj_29)
   deleted: (pred_6 obj_29)
   added: (pred_12) (pred_5 obj_29 obj_06)
   goals met: 1 of 1
